Repository: abreuretto72/MviewerPlus
Catalog: lib/l10n/app_*.arb
Languages: es, pt_pt

# actionRootDesc
source: Your device has superuser privileges (root). This compromises app security.
es: Su dispositivo tiene privilegios de superusuario (root). Esto compromete la seguridad de la aplicación.
pt_pt: O seu dispositivo tem privilégios de superutilizador (root). Isto compromete a segurança da aplicação.

# actionRootRec
source: Remove root or use a non-rooted device.
es: Elimine el root del dispositivo o use un dispositivo sin root.
pt_pt: Remova o root do dispositivo ou use um dispositivo sem root.

# actionDebuggerTitle
source: Debugger Detected
es: Debugger Detectado
pt_pt: Debugger Detectado

# actionDebuggerDesc
source: A debugger is attached to the application. This may indicate an attempt to analyze or modify the app.
es: Un debugger está adjunto a la aplicación. Esto puede indicar un intento de analizar o modificar la app.
pt_pt: Um debugger está anexado à aplicação. Isto pode indicar tentativa de análise ou modificação da app.

# actionDebuggerRec
source: Close all developer tools and restart.
es: Cierre todas las herramientas de desarrollo y reinicie la app.
pt_pt: Feche todas as ferramentas de desenvolvimento e reinicie a app.

# actionHookingTitle
source: Hooking Framework Detected
es: Framework de Hooking Detectado
pt_pt: Framework de Hooking Detectado

# actionHookingDesc
source: A hooking framework (Frida, Xposed) was detected. This allows modifying app behavior.
es: Se detectó un framework de hooking (Frida, Xposed, etc.). Esto puede permitir modificar el comportamiento de la app.
pt_pt: Foi detectado um framework de hooking (Frida, Xposed, etc.). Isto pode permitir modificação do comportamento da app.

# actionHookingRec
source: Remove hooking frameworks and restart.
es: Elimine frameworks de hooking y reinicie el dispositivo.
pt_pt: Remova frameworks de hooking e reinicie o dispositivo.

# actionIntegrityTitle
source: Compromised App Integrity
es: Integridad de la App Comprometida
pt_pt: Integridade da App Comprometida

# actionIntegrityDesc
source: The app signature does not match expected. The app may have been modified.
es: La firma de la aplicación no coincide con la esperada. La app puede haber sido modificada.
pt_pt: A assinatura da aplicação não corresponde à esperada. A app pode ter sido modificada.

# actionIntegrityRec
source: Reinstall from the official store (Play Store).
es: Reinstale la app desde la tienda oficial (Google Play/App Store).
pt_pt: Reinstale a app da loja oficial (Google Play/App Store).

# actionOSTitle
source: Outdated Operating System
es: Sistema Operativo Desactualizado
pt_pt: Sistema Operativo Desatualizado

# actionOSDesc
source: Your OS is outdated and may contain vulnerabilities.
es: Su sistema operativo está desactualizado y puede contener vulnerabilidades de seguridad.
pt_pt: O seu sistema operativo está desatualizado e pode conter vulnerabilidades de segurança.

# actionOSRec
source: Update your OS to the latest version.
es: Actualice su sistema operativo a la versión más reciente.
pt_pt: Atualize o seu sistema operativo para a versão mais recente.

# actionLockTitle
source: No Screen Lock Configured
es: Bloqueo de Pantalla No Configurado
pt_pt: Bloqueio de Ecrã Não Configurado

# actionLockDesc
source: Your device has no screen lock. This facilitates unauthorized access.
es: Su dispositivo no tiene bloqueo de pantalla configurado. Esto facilita el acceso no autorizado.
pt_pt: O seu dispositivo não possui bloqueio de ecrã configurado. Isto facilita o acesso não autorizado.

# actionLockRec
source: Set up a PIN, password, or pattern in settings.
es: Configure un PIN, contraseña, patrón o biometría en la configuración.
pt_pt: Configure um PIN, palavra-passe, padrão ou biometria nas definições.

# actionEmulatorTitle
source: Running on Emulator
es: Ejecutando en Emulador
pt_pt: A Executar em Emulador

# actionEmulatorDesc
source: The app is running on an emulator. Some features may be limited.
es: La app se está ejecutando en un emulador. Algunas funcionalidades pueden estar limitadas.
pt_pt: A app está a correr num emulador. Algumas funcionalidades podem estar limitadas.

# actionEmulatorRec
source: Use a physical device for better experience.
es: Use un dispositivo físico para una mejor experiencia.
pt_pt: Use um dispositivo físico para melhor experiência.

# actionUnknownSourcesTitle
source: Unknown Sources Enabled
es: Instalación de Fuentes Desconocidas Activada
pt_pt: Instalação de Fontes Desconhecidas Ativada

# actionUnknownSourcesDesc
source: Your device allows installing apps from unknown sources. This facilitates malware installation.
es: Su dispositivo permite instalar apps de fuentes desconocidas. Esto facilita la instalación de malware.
pt_pt: O seu dispositivo permite instalação de apps de fontes desconhecidas. Isto facilita a instalação de malware.

# actionUnknownSourcesRec
source: Disable 'Install unknown apps' in security settings.
es: Desactive 'Instalar apps de fuentes desconocidas' en la configuración de seguridad.
pt_pt: Desative 'Instalar apps de fontes desconhecidas' nas definições de segurança.

# actionLocationTitle
source: Apps with 'Always' Location
es: Apps con Ubicación 'Siempre' Detectadas
pt_pt: Apps com Localização 'Sempre' Detectados

# actionLocationDesc
source: {count} app(s) have background location permission. This poses a privacy risk.
es: {count} app(s) tienen permiso de rastreo de ubicación en segundo plano. Esto representa un riesgo de privacidad.
pt_pt: {count} app(s) têm permissão de rastreio de localização em segundo plano. Isto representa risco de privacidade.

# actionLocationRec
source: Review location permissions.
es: Revise los permisos de ubicación y cambie a 'Solo durante el uso' cuando sea posible.
pt_pt: Reveja as permissões de localização e mude para 'Apenas durante o uso' quando possível.

# actionNotifTitle
source: Sensitive Notifications on Lock Screen
es: Notificaciones Sensibles en Pantalla de Bloqueo
pt_pt: Notificações Sensíveis Visíveis no Ecrã de Bloqueio

# actionNotifDesc
source: Sensitive notification previews (codes, messages) are visible on lock screen.
es: Previsualizaciones de notificaciones (mensajes, códigos 2FA) son visibles en la pantalla de bloqueo. Esto puede permitir la interceptación de datos sensibles.
pt_pt: Pré-visualizações de notificações (mensagens, códigos 2FA) são exibidas no ecrã de bloqueio. Isto pode permitir interceção de dados sensíveis.

# actionNotifRec
source: Hide sensitive content on lock screen notifications.
es: Configure para ocultar contenido sensible en las notificaciones de la pantalla de bloqueo.
pt_pt: Configure para ocultar conteúdo sensível nas notificações do ecrã de bloqueio.

# actionPatchTitle
source: Outdated Security Patch
es: Parche de Seguridad Desactualizado
pt_pt: Patch de Segurança Desatualizado

# actionPatchDesc
source: Security patch is older than 60 days. Known vulnerabilities may not be patched.
es: El parche de seguridad de su dispositivo tiene más de 60 días.
pt_pt: O patch de segurança do seu dispositivo tem mais de 60 dias.

# actionPatchRec
source: Check for system updates.
es: Verifique actualizaciones del sistema en la configuración.
pt_pt: Verifique por atualizações do sistema nas definições.

# action2FATitle
source: Enable Two-Factor Authentication (2FA)
es: Active la Autenticación de Dos Factores (2FA)
pt_pt: Ative a Autenticação de Dois Fatores (2FA)

# action2FADesc
source: 2FA adds an extra layer of security to your critical accounts (Google/Apple ID).
es: La autenticación de dos factores añade una capa extra de seguridad a sus cuentas críticas.
pt_pt: A autenticação de dois fatores adiciona uma camada extra de segurança às suas contas críticas.

# action2FARec
source: Enable 2FA in your account security settings.
es: Active el 2FA en la configuración de seguridad de su cuenta.
pt_pt: Ative o 2FA nas definições de segurança da sua conta.

# expAppSignaturesTitle
source: App Monitoring
es: Monitoreo de Apps
pt_pt: Monitorização de Apps

# expAppSignaturesDesc
source: Checks if sensitive apps (like banking and social media apps) are original and have not been modified by hackers. ⚠️ Why is it critical? • Fake apps can steal your banking credentials • Can clone your WhatsApp • Can intercept 2FA codes ✅ What does it mean? If failed: An installed app is not the original from the official store (Play Store) and may be dangerous.
es: Verifica si las apps sensibles son originales. ⚠️ ¿Por qué es crítico? • Las apps falsas pueden robar credenciales ✅ ¿Qué significa? Si falla: Alguna app puede ser peligrosa.
pt_pt: Verifica se aplicativos sensíveis são originais. ⚠️ Por que é crítico? • Apps falsas podem roubar credenciais ✅ O que significa? Se falhou: Alguma app pode ser perigosa.

# expRootDesc
source: Root (Android) or Jailbreak (iOS) is when someone modifies the system to gain full access. ⚠️ Why is it dangerous? • Malicious apps can steal your passwords • Your banking data becomes vulnerable • Banking apps might not work ✅ What to do? If you didn't do this on purpose, your device may be compromised. Consider factory resetting it.
es: Root o Jailbreak es cuando modifican el sistema del móvil para tener acceso total. ⚠️ ¿Por qué es peligroso? • Datos bancarios vulnerables ✅ ¿Qué hacer? Considere restaurar la configuración de fábrica.
pt_pt: Root ou Jailbreak é quando modificam o sistema do telemóvel para ter acesso total. ⚠️ Por que é perigoso? • Dados bancários vulneráveis ✅ O que fazer? Considere restaurar as configurações de fábrica.

# expDebuggerTitle
source: Debugger Detected
es: Debugger (Depurador)
pt_pt: Debugger (Depurador)

# expDebuggerDesc
source: A debugger is a tool used by programmers to analyze apps. ⚠️ Why is it dangerous? • Hackers can use it to spy on the app • Can discover passwords and sensitive data • Can modify app behavior ✅ What to do? If you are not a developer, you shouldn't have an active debugger. Close developer instruments or restart the phone.
es: Herramienta para analizar apps. ⚠️ ¿Peligro? • Espionaje de datos ✅ ¿Acción? Reinicie el móvil si no es desarrollador.
pt_pt: Ferramenta para analisar apps. ⚠️ Perigo? • Espionagem de dados ✅ Ação? Reinicie o telemóvel se não for programador.

# expHookingTitle
source: Hooking Framework
es: Hooking
pt_pt: Hooking

# expHookingDesc
source: Hooking is when a malicious program intercepts and modifies how apps work. ⚠️ Why is it dangerous? • Can steal your passwords as you type • Can modify banking transactions • Can read private messages ✅ What to do? Uninstall suspicious apps, especially 'optimizers' or 'boosters' you don't recognize.
es: Modificación de apps en tiempo real. ⚠️ ¿Peligro? • Robo de datos ✅ ¿Acción? Desinstale apps sospechosas.
pt_pt: Modificação de apps em tempo real. ⚠️ Perigo? • Roubo de dados ✅ Ação? Desinstale apps suspeitas.

# expIntegrityTitle
source: App Integrity
es: Integridad de la App
pt_pt: Integridade da App

# expIntegrityDesc
source: Checks if this app has been modified after installation. ⚠️ Why is it important? • Modified apps may contain viruses • Can steal your data • Might not work correctly ✅ What does it mean? If passed: The app is original and safe If failed: The app may have been tampered with
es: Verifica si esta app ha sido modificada. ⚠️ Importante: • Apps alteradas pueden tener virus ✅ Significado: Pasó = App original.
pt_pt: Verifica se esta app foi modificada. ⚠️ Importante: • Apps alteradas podem ter vírus ✅ Significado: Passou = App original.

# expOSTitle
source: System Updated
es: Sistema Actualizado
pt_pt: Sistema Atualizado

# expOSDesc
source: Checks if your Android/iOS is up to date. ⚠️ Why is it important? • Old systems have known security flaws • Hackers exploit these flaws • You are vulnerable to viruses ✅ What to do? Go to Settings → System Update and install available updates.
es: Verifica actualizaciones del sistema. ⚠️ Importante: • Sistemas antiguos tienen fallos ✅ Acción: Actualice el sistema.
pt_pt: Verifica atualizações do sistema. ⚠️ Importante: • Sistemas antigos têm falhas ✅ Ação: Atualize o sistema.

# expLockTitle
source: Screen Lock
es: Bloqueo de Pantalla
pt_pt: Bloqueio de Ecrã

# expLockDesc
source: Checks if you have a password, PIN, pattern, or biometrics set up. ⚠️ Why is it important? • Anyone can take your unlocked phone • Can access your apps, photos, and messages • Can make purchases or transfers ✅ What to do? Set up a strong password or use your fingerprint/face ID in Settings → Security.
es: Verifica si tiene contraseña o biometría. ⚠️ Importante: • Impede acceso físico no autorizado ✅ Acción: Configure una contraseña fuerte.
pt_pt: Verifica se tem senha ou biometria. ⚠️ Importante: • Impede acesso físico não autorizado ✅ Ação: Configure uma senha forte.

# expEmulatorTitle
source: Real Device
es: Dispositivo Real
pt_pt: Dispositivo Real

# expEmulatorDesc
source: Checks if you are using a real phone or an emulator (virtual phone on computer). ⚠️ Why is it important? • Emulators are used by hackers to test attacks • Banking apps don't work on emulators • May indicate fraud attempt ✅ What does it mean? If you are on a real phone, you should pass this check.
es: Verifica si es un móvil real o virtual. ✅ Significado: Debe usar un móvil real.
pt_pt: Verifica se é um telemóvel real ou virtual. ✅ Significado: Deve usar um telemóvel real.
