Repository: abreuretto72/MviewerPlus
Catalog: lib/l10n/app_*.arb
Languages: es, pt_pt

source: Open File
es: Abrir Archivo
pt_pt: Abrir Ficheiro

source: Copy Content
es: Copiar Contenido
pt_pt: Copiar Conteúdo

# copiedToClipboard
source: Content copied to clipboard
es: Contenido copiado al portapapeles
pt_pt: Conteúdo copiado para a área de transferência

source: Error loading file
es: Error al cargar el archivo
pt_pt: Erro ao carregar ficheiro

source: Empty CSV
es: CSV vacío
pt_pt: CSV Vazio

# subtitle
source: The Universal File Reader
es: El Lector Universal de Archivos
pt_pt: O Leitor Universal de Ficheiros

# supportsHint
source: Supports .txt, .json, .csv, .xml, .sql, .log & more
es: Soporta .txt, .json, .csv, .xml, .sql, .log y más
pt_pt: Suporta .txt, .json, .csv, .xml, .sql, .log e outros

source: Privacy Policy
es: Política de Privacidad
pt_pt: Política de Privacidade

source: Settings
es: Configuración
pt_pt: Definições

source: Terms of Service
es: Términos de Servicio
pt_pt: Termos de Serviço

source: Language
es: Idioma
pt_pt: Idioma

source: Theme
es: Tema
pt_pt: Tema

# apiKey
source: AI API Key
es: Clave API de IA
pt_pt: Chave de API da IA

# enterApiKey
source: Enter your Groq API Key
es: Ingrese su Clave API de Groq
pt_pt: Insira a sua Chave de API da Groq

# apiKeyDesc
source: Get free API Key
es: Obtener clave gratuita
pt_pt: Obter a chave gratuita

source: Save
es: Guardar
pt_pt: Guardar

# getApiKeyHelpBtn
source: How to get a key? (Tap here)
es: ¿Cómo obtener una clave? (Toca aquí)
pt_pt: Como obter uma chave? (Toque aqui)

# getApiKeyDialogTitle
source: Getting a Groq API Key
es: Obteniendo una Clave API de Groq
pt_pt: Obter uma Chave de API da Groq

# getApiKeyDialogContent
source: 1. Go to console.groq.com 2. Sign up or log in 3. Go to "API Keys" section 4. Create a new key and copy it here.
es: 1. Ve a console.groq.com 2. Regístrate o inicia sesión 3. Ve a la sección "API Keys" 4. Crea una nueva clave y cópiala aquí.
pt_pt: 1. Aceda a console.groq.com 2. Registe-se ou inicie sessão 3. Vá à secção "API Keys" 4. Crie uma nova chave e copie-a aqui.

source: Close
es: Cerrar
pt_pt: Fechar

source: Cancel
es: Cancelar
pt_pt: Cancelar

source: AI Assistant
es: Asistente IA
pt_pt: Assistente IA

# askAboutFile
source: Ask about the file...
es: Pregunte sobre el archivo...
pt_pt: Pergunte sobre o ficheiro...

source: System Note
es: Nota del Sistema
pt_pt: Nota do Sistema

# analyzedFile
source: I have analyzed {fileName}. Ask me anything about its content!
es: He analizado {fileName}. ¡Pregúntame lo que quieras sobre su contenido!
pt_pt: Analisei {fileName}. Pergunte-me qualquer coisa sobre o conteúdo!

# fileTooLarge
source: File is too large. Content has truncated for analysis.
es: Archivo demasiado grande. Contenido truncado para el análisis.
pt_pt: Ficheiro muito grande. Conteúdo truncado para análise.

# privacyPolicyContent
source: Last updated: December 2025 This Privacy Policy describes how MviewerPlus handles your information. 1. Data Collection We do not collect personal data. File processing is local. 2. AI Features (Groq) When using the AI assistant, file content is sent to Groq API using your personal API Key. No data is stored by us. 3. Free Model This app is 100% free, open-source, and does not display ads. 4. Contact For questions, please contact: contato@multiversodigital.com.br
es: Última actualización: Diciembre de 2025 Esta Política de Privacidad describe cómo MviewerPlus maneja su información. 1. Recopilación de Datos No recopilamos datos personales. El procesamiento es local. 2. Funciones de IA Al usar el asistente de IA, el contenido se envía a la API de Groq usando su Clave API personal. No almacenamos datos. 3. Modelo Gratuito Esta aplicación es 100% gratuita, de código abierto y sin anuncios. 4. Contacto Si tiene dudas, contáctenos: contato@multiversodigital.com.br
pt_pt: Última atualização: Dezembro de 2025 Esta Política de Privacidade descreve como o MviewerPlus trata as suas informações. 1. Recolha e Processamento Não recolhemos dados pessoais. O processamento de ficheiros é local. 2. Recursos de IA Ao usar o assistente de IA, o conteúdo do ficheiro é enviado para a API da Groq usando a sua Chave de API pessoal. 3. Modelo Gratuito Esta aplicação é 100% gratuita, open-source e não apresenta anúncios. 4. Contacto Em caso de dúvidas, contacte: contato@multiversodigital.com.br

# termsContent
source: Terms of Service By using MviewerPlus, you agree to these terms. 1. Usage You are responsible for the content you access using this viewer. 2. Liability The developer is not liable for any data loss or issues arising from using this software. 3. Updates These terms may change at any time.
es: Términos de Servicio Al usar MviewerPlus, aceptas estos términos. 1. Uso Eres responsable del contenido al que accedes utilizando este visor. 2. Responsabilidad El desarrollador no se hace responsable de ninguna pérdida de datos o problemas derivados del uso de este software. 3. Actualizaciones Estos términos pueden cambiar en cualquier momento.
pt_pt: Termos de Serviço Ao usar o MviewerPlus, concorda com estes termos. 1. Utilização É responsável pelo conteúdo que acede usando este visualizador. 2. Responsabilidade O programador não se responsabiliza por qualquer perda de dados ou problemas decorrentes do uso deste software. 3. Atualizações Estes termos podem mudar a qualquer momento.

source: About
es: Acerca de
pt_pt: Sobre

# appVersion
source: Version 1.0.0
es: Versión 1.0.0
pt_pt: Versão 1.0.0

source: Copy Message
es: Copiar Mensaje
pt_pt: Copiar Mensagem

# exportPdf
source: Export to PDF
es: Exportar a PDF
pt_pt: Exportar para PDF

# pdfGenerated
source: PDF generated successfully
es: PDF generado con éxito
pt_pt: PDF gerado com sucesso

source: Error generating PDF
es: Error al generar PDF
pt_pt: Erro ao gerar PDF

# exportOptionsTitle
source: Export Options
es: Opciones de Exportación
pt_pt: Opções de Exportação

# exportOptionsContent
source: Do you also want to generate a PDF for the original file?
es: ¿Desea también generar un PDF del archivo original?
pt_pt: Deseja também gerar um PDF do ficheiro original?

# exportChatOnly
source: Chat Only
es: Solo Chat
pt_pt: Apenas Chat

# exportBoth
source: Chat & File
es: Chat y Archivo
pt_pt: Chat e Ficheiro

source: Print
es: Imprimir
pt_pt: Imprimir

source: Share
es: Compartir
pt_pt: Partilhar

# saveChangesTitle
source: Save Copy?
es: ¿Guardar Copia?
pt_pt: Guardar Cópia?

# saveChangesContent
source: This will save a copy of the edit file. The original file will be preserved.
es: Esto guardará una copia del archivo editado. El archivo original será preservado.
pt_pt: Isto guardará uma cópia do ficheiro editado. O ficheiro original será preservado.

# saveCopySuccess
source: File copy saved at: {path}
es: Copia guardada en: {path}
pt_pt: Cópia guardada em: {path}

source: Saved Files
es: Archivos Guardados
pt_pt: Ficheiros Guardados

# noSavedFiles
source: No saved files found
es: No se encontraron archivos guardados
pt_pt: Nenhum ficheiro guardado encontrado

source: History
es: Historial
pt_pt: Histórico

# deleteTitle
source: Confirm Deletion
es: Confirmar Eliminación
pt_pt: Confirmar Eliminação

# deleteContent
source: Are you sure you want to remove this item?
es: ¿Está seguro de que desea eliminar este elemento?
pt_pt: Tem a certeza que deseja remover este item?

source: Delete
es: Eliminar
pt_pt: Eliminar

source: Find
es: Buscar
pt_pt: Localizar

source: Replace
es: Reemplazar
pt_pt: Substituir

source: Replace All
es: Reemplazar Todo
pt_pt: Substituir Tudo

# replacedSuccess
source: Replaced {count} occurrences
es: Se reemplazaron {count} ocurrencias
pt_pt: {count} ocorrências substituídas

# includeOriginal
source: Include File Content
es: Incluir Contenido del Archivo
pt_pt: Incluir Conteúdo do Ficheiro

source: Processing...
es: Procesando...
pt_pt: A processar...

# processingColumns
source: Analyzing {columns} columns...
es: Analizando {columns} columnas...
pt_pt: A analisar {columns} colunas...

# pdfReportTitle
source: MviewerPlus Report
es: Reporte MviewerPlus
pt_pt: Relatório MviewerPlus

# pdfGeneratedLabel
source: Generated:
es: Generado:
pt_pt: Gerado em:

# pdfFileLabel
source: File:
es: Archivo:
pt_pt: Ficheiro:

# pdfSizeLabel
source: Size:
es: Tamaño:
pt_pt: Tamanho:

# pdfRecordsLabel
source: Records:
es: Registros:
pt_pt: Registos:

# pdfPage
source: Page
es: Página
pt_pt: Página

# pdfOf
source: of
es: de
pt_pt: de

source: rows
es: filas
pt_pt: linhas

source: files
es: archivos
pt_pt: ficheiros

source: lines
es: líneas
pt_pt: linhas

# archiveBadge
source: ARCHIVE
es: ARCHIVO
pt_pt: ARQUIVO

# zipEmpty
source: Empty or invalid ZIP archive
es: Archivo ZIP vacío o inválido
pt_pt: Ficheiro ZIP vazio ou inválido

# zipArchiveInfo
source: Zip Archive ({count} files)
es: Archivo ZIP ({count} archivos)
pt_pt: Ficheiro ZIP ({count} ficheiros)

source: File Name
es: Nombre del Archivo
pt_pt: Nome do Ficheiro

# fileType
source: Type
es: Tipo
pt_pt: Tipo

# fileSizeCol
source: Size (KB)
es: Tamaño (KB)
pt_pt: Tamanho (KB)

# searchNotAvailableZip
source: Search not available for archive files.
es: Búsqueda no disponible para archivos comprimidos.
pt_pt: Pesquisa não disponível para ficheiros compactados.

# readOnlyFormat
source: This format is read-only.
es: Este formato es de solo lectura.
pt_pt: Este formato é apenas de leitura.

# processingWait
source: Reading file, please wait.
es: Leyendo archivo, espera.
pt_pt: A ler ficheiro, aguarde.

# loadingTitle
source: Loading...
es: Cargando...
pt_pt: A carregar...

source: Help
es: Ayuda
pt_pt: Ajuda

# helpTitle
source: Help Guide
es: Guía de Ayuda
pt_pt: Guia de Ajuda

# featuresSection
source: Key Features
es: Funcionalidades Principales
pt_pt: Funcionalidades Principais

# featuresContent
source: • Quick View: Open large files instantly. • Edit & Search: Edit text, find and replace terms. • Export & Share: Generate PDFs, print, and share your files. • Smart Tables: View CSV and Excel with filters and sorting. • Code Editor: Syntax highlighting for 30+ languages. • AI Analysis: Enter your Groq API Key to let AI analyze file content. • ZIP Archives: Explore compressed file contents.
es: • Vista Rápida: Abre archivos grandes al instante con rendimiento nativo. • Edición y Búsqueda: Edite texto, código y datos. Búsqueda avanzada 'Buscar y Reemplazar'. • Edición Segura: Sus archivos originales nunca se modifican. Las copias se guardan en el 'Historial' del Menú Principal. • Tablas Inteligentes: Visualice CSV y Excel como hojas de cálculo interactivas con filtros. • Editor de Código: Resaltado de sintaxis para más de 30 lenguajes (Dart, JS, Python, SQL...). • Verificación de Seguridad: Verifique integridad de app, root, debuggers y firmas digitales. • Análisis de IA: Ingrese su Clave API Groq para 'chatear' con sus documentos. • Archivos ZIP: Explore dentro de archivos comprimidos como carpetas. • Multimedia: Reproductor nativo para audio y video.
pt_pt: • Visualização Rápida: Abra grandes ficheiros instantaneamente com performance nativa. • Edição e Pesquisa: Edite texto, código e dados. Use 'Localizar e Substituir' avançado. • Edição Segura: Os seus ficheiros originais nunca são alterados. As cópias são guardadas no 'Histórico' do Menu Principal. • Tabelas Inteligentes: Visualize CSVs e Excel como folhas de cálculo interativas com ordenação e filtros. • Editor de Código: Realce de sintaxe para mais de 30 linguagens (Dart, JS, Python, SQL...). • Verificação de Segurança: Verifique integridade da app, root, debuggers e assinaturas digitais. • Análise IA: Insira a sua Chave API Groq para 'conversar' com os seus documentos. • Ficheiros ZIP: Navegue dentro de ficheiros comprimidos como pastas. • Multimídia: Player nativo para áudio e vídeo.

# formatsSection
source: Supported Formats
es: Formatos Soportados
pt_pt: Formatos Suportados

source: Exit
es: Salir
pt_pt: Sair

# exitConfirm
source: Do you want to close the app?
es: ¿Desea cerrar la aplicación?
pt_pt: Deseja fechar a aplicação?

# formatsContent
source: • Text: .txt, .md, .log, .rtf • Data: .csv, .json, .xml, .xlsx, .xls • Code: Dart, JS, Python, Java, C++, HTML, CSS, SQL... • Images: .png, .jpg, .gif • Multimedia: .mp3, .wav, .mp4, .avi • Docs: .pdf, .docx • Other: .zip, .apk
es: • Texto & Código: .txt, .md, .log, .json, .xml, .yaml, .yml, .html, .css, .js, .ts, .dart, .java, .kt, .swift, .py, .rb, .php, .go, .c, .cpp, .cs, .sql, .sh, .conf, .env, .ini • Datos & Hojas de Cálculo: .csv, .xlsx, .xls • Documentos: .pdf, .docx (texto) • Imágenes: .png, .jpg, .jpeg, .gif, .webp, .bmp • Audio: .mp3, .wav, .ogg, .m4a, .aac, .flac • Video: .mp4, .mov, .avi, .mkv, .webm, .wmv, .flv, .3gp • Archivos: .zip, .apk, .jar • Certificados: .pem, .crt, .cer, .p12, .pfx, .der
pt_pt: • Texto & Código: .txt, .md, .log, .json, .xml, .yaml, .yml, .html, .css, .js, .ts, .dart, .java, .kt, .swift, .py, .rb, .php, .go, .c, .cpp, .cs, .sql, .sh, .conf, .env, .ini • Dados & Folhas de Cálculo: .csv, .xlsx, .xls • Documentos: .pdf, .docx (texto) • Imagens: .png, .jpg, .jpeg, .gif, .webp, .bmp • Áudio: .mp3, .wav, .ogg, .m4a, .aac, .flac • Vídeo: .mp4, .mov, .avi, .mkv, .webm, .wmv, .flv, .3gp • Arquivos: .zip, .apk, .jar • Certificados: .pem, .crt, .cer, .p12, .pfx, .der

source: Cookie Inspector
es: Inspector de Cookies
pt_pt: Inspetor de Cookies

# cookieInspectorDesc
source: Manage and analyze cookies
es: Administrar y analizar cookies
pt_pt: Gerir e analisar cookies

source: HTTP Cookies
es: Cookies HTTP
pt_pt: Cookies HTTP

source: WebView Cookies
es: Cookies WebView
pt_pt: Cookies WebView

source: Security & Logs
es: Seguridad y Registros
pt_pt: Segurança e Registos

# cookieWarning
source: Cookies may contain session and login tokens. Use with caution.
es: Las cookies pueden contener tokens de sesión. Úselas con precaución.
pt_pt: Cookies podem conter tokens de sessão. Use com cuidado.

source: URL or Domain
es: URL o Dominio
pt_pt: URL ou Domínio

# listCookies
source: List
es: Listar
pt_pt: Listar

# exportCookies
source: Export
es: Exportar
pt_pt: Exportar

# deleteAllCookies
source: Delete All
es: Eliminar Todo
pt_pt: Apagar Tudo

source: No cookies found
es: No se encontraron cookies
pt_pt: Nenhum cookie encontrado

# enterUrlAndList
source: Enter a URL and click 'List'
es: Ingrese una URL y haga clic en 'Listar'
pt_pt: Insira um URL e clique em 'Listar'

# cookieName
source: Name
es: Nombre
pt_pt: Nome

# cookieValue
source: Value
es: Valor
pt_pt: Valor

# cookieDomain
source: Domain
es: Dominio
pt_pt: Domínio

# cookiePath
source: Path
es: Ruta
pt_pt: Caminho

# cookieExpires
source: Expires
es: Expira
pt_pt: Expira

# cookieSecure
source: Secure
es: Seguro
pt_pt: Seguro

# cookieSensitive
source: Sensitive cookie
es: Cookie sensible
pt_pt: Cookie sensível

source: Security Signals
es: Señales de Seguridad
pt_pt: Sinais de Segurança

source: Copy Value
es: Copiar Valor
pt_pt: Copiar Valor

# editCookie
source: Edit
es: Editar
pt_pt: Editar

# deleteCookie
source: Delete
es: Eliminar
pt_pt: Apagar

# revealValue
source: Reveal full value
es: Revelar valor completo
pt_pt: Revelar valor completo

source: Confirm Deletion
es: Confirmar Eliminación
pt_pt: Confirmar Eliminação

# deleteConfirmMsg
source: Do you want to delete the cookie "{name}"?
es: ¿Desea eliminar la cookie "{name}"?
pt_pt: Deseja apagar o cookie "{name}"?

# sessionWarning
source: This action may end active sessions.
es: Esta acción puede cerrar sesiones activas.
pt_pt: Esta ação pode encerrar sessões ativas.

# deleteAllConfirmTitle
source: ⚠️ Confirm Mass Deletion
es: ⚠️ Confirmar Eliminación Masiva
pt_pt: ⚠️ Confirmar Eliminação em Massa

# deleteAllConfirmMsg
source: Do you want to delete ALL cookies?
es: ¿Desea eliminar TODAS las cookies?
pt_pt: Deseja apagar TODOS os cookies?

# deleteAllWarning
source: ATTENTION: This action is irreversible! • All sessions will be ended • You will be logged out of sites • Saved settings will be lost
es: ATENCIÓN: ¡Esta acción es irreversible! • Se cerrarán todas las sesiones • Se desconectará de sitios • Se perderán configuraciones guardadas
pt_pt: ATENÇÃO: Esta ação é irreversível! • Todas as sessões serão encerradas • Será desligado de sites • Definições guardadas serão perdidas

# understandWarning
source: I understand this may end sessions
es: Entiendo que esto puede cerrar sesiones
pt_pt: Entendo que isto pode encerrar sessões

# exportFormat
source: Export Cookies
es: Exportar Cookies
pt_pt: Exportar Cookies

# exportWarning
source: This report contains authentication cookies.
es: Este reporte contiene cookies de autenticación.
pt_pt: Este relatório contém cookies de autenticação.

# exportMasked
source: Masked values (recommended)
es: Valores ocultos (recomendado)
pt_pt: Valores mascarados (recomendado)

# exportMaskedDesc
source: Sensitive cookies will be protected
es: Cookies sensibles serán protegidas
pt_pt: Cookies sensíveis serão protegidos

# exportReal
source: Real values
es: Valores reales
pt_pt: Valores reais

# exportRealDesc
source: Requires additional authentication
es: Requiere autenticación adicional
pt_pt: Requer autenticação adicional

source: 📊 Statistics
es: 📊 Estadísticas
pt_pt: 📊 Estatísticas

source: Total Cookies
es: Total de Cookies
pt_pt: Total de Cookies

source: Total Domains
es: Total de Dominios
pt_pt: Total de Domínios

source: Secure Cookies
es: Cookies Seguras
pt_pt: Cookies Seguros

source: HttpOnly Cookies
es: Cookies HttpOnly
pt_pt: Cookies HttpOnly

source: Expired Cookies
es: Cookies Expirados
pt_pt: Cookies Expirados

source: 🔐 Security Report
es: 🔐 Reporte de Seguridad
pt_pt: 🔐 Relatório de Segurança

source: View Details
es: Ver Detalles
pt_pt: Ver Detalhes

source: 🔒 Security Settings
es: 🔒 Configuración de Seguridad
pt_pt: 🔒 Definições de Segurança

# biometricAuth
source: Biometric Authentication
es: Autenticación Biométrica
pt_pt: Autenticação Biométrica

source: Protect sensitive actions
es: Proteger acciones sensibles
pt_pt: Proteger ações sensíveis

source: Configure PIN
es: Configurar PIN
pt_pt: Configurar PIN

# alternativePin
source: Alternative security PIN
es: PIN de seguridad alternativo
pt_pt: PIN de segurança alternativo

# authRequired
source: Authentication Required
es: Autenticación Requerida
pt_pt: Autenticação Necessária

# configurePinMsg
source: Configure a security PIN to protect sensitive actions.
es: Configure un PIN de seguridad para proteger acciones sensibles.
pt_pt: Configure um PIN de segurança para proteger ações sensíveis.

# enterPin
source: Enter your PIN
es: Ingrese su PIN
pt_pt: Insira o seu PIN

# pinMinLength
source: PIN (minimum 4 digits)
es: PIN (mínimo 4 dígitos)
pt_pt: PIN (mínimo 4 dígitos)

source: Confirm PIN
es: Confirmar PIN
pt_pt: Confirmar PIN

source: PINs do not match
es: Los PINs no coinciden
pt_pt: Os PINs não coincidem

# pinTooShort
source: PIN must be at least 4 digits
es: El PIN debe tener al menos 4 dígitos
pt_pt: O PIN deve ter pelo menos 4 dígitos

source: PIN configured
es: PIN configurado
pt_pt: PIN configurado

source: Error configuring PIN
es: Error al configurar PIN
pt_pt: Erro ao configurar PIN

# webviewLimitations
source: Note: Cookies with httpOnly and secure flags may not be visible through JavaScript. To view all cookies, use browser developer tools or access via HTTP Cookie Manager.
es: Nota: Cookies con flags httpOnly y secure pueden no ser visibles por JavaScript. Para ver todas, use herramientas de desarrollador o HTTP Cookie Manager.
pt_pt: Nota: Cookies com flags httpOnly e secure podem não ser visíveis via JavaScript. Para ver todos, use ferramentas de programador ou HTTP Cookie Manager.

# webviewRequiresActive
source: This functionality requires an active WebView.
es: Esta función requiere un WebView activo.
pt_pt: Esta funcionalidade requer uma WebView ativa.

# valueCopied
source: Value copied to clipboard
es: Valor copiado al portapapeles
pt_pt: Valor copiado para a área de transferência

source: Cookie updated
es: Cookie actualizada
pt_pt: Cookie atualizado

source: Error updating cookie
es: Error al actualizar cookie
pt_pt: Erro ao atualizar cookie

source: Cookie deleted
es: Cookie eliminada
pt_pt: Cookie apagado

source: Error deleting cookie
es: Error al eliminar cookie
pt_pt: Erro ao apagar cookie

# allCookiesDeleted
source: All cookies have been deleted
es: Todas las cookies han sido eliminadas
pt_pt: Todos os cookies foram apagados

source: Error deleting cookies
es: Error al eliminar cookies
pt_pt: Erro ao apagar cookies

source: No cookies to export
es: No hay cookies para exportar
pt_pt: Nenhum cookie para exportar

# jsonCopied
source: JSON copied to clipboard
es: JSON copiado al portapapeles
pt_pt: JSON copiado para área de transferência

# csvCopied
source: CSV copied to clipboard
es: CSV copiado al portapapeles
pt_pt: CSV copiado para área de transferência

# errorExporting
source: Error exporting: {error}
es: Error al exportar: {error}
pt_pt: Erro ao exportar: {error}

source: Full Security Report
es: Reporte de Seguridad Completo
pt_pt: Relatório de Segurança Completo

source: Report copied
es: Reporte copiado
pt_pt: Relatório copiado

source: Go Premium
es: Hacerse Premium
pt_pt: Tornar-se Premium

source: Restore Purchases
es: Restaurar Compras
pt_pt: Restaurar Compras

# premiumDesc
source: Unlock unlimited access and remove ads.
es: Desbloquee acceso ilimitado y elimine anuncios.
pt_pt: Desbloqueie acesso ilimitado e remova anúncios.

# securityCheckDesc
source: Verify device security
es: Verificar seguridad del dispositivo
pt_pt: Verificar segurança do dispositivo

source: Security Check
es: Verificación de Seguridad
pt_pt: Verificação de Segurança

source: Refresh
es: Actualizar
pt_pt: Atualizar

# securityCheckError
source: Error checking security: {error}
es: Error al verificar la seguridad: {error}
pt_pt: Erro ao verificar a segurança: {error}

source: No results available
es: No hay resultados disponibles.
pt_pt: Nenhum resultado disponível.

source: Security Level
es: Nivel de Seguridad
pt_pt: Nível de Segurança

source: Risk Score
es: Puntaje de Riesgo
pt_pt: Pontuação de Risco

source: Checks
es: Verificaciones
pt_pt: Verificações

source: Recommended Actions
es: Acciones Recomendadas
pt_pt: Ações Recomendadas

source: Critical Threats
es: Amenazas Críticas
pt_pt: Ameaças Críticas

source: Warnings
es: Advertencias
pt_pt: Avisos

source: Safe
es: Seguro
pt_pt: Seguro

source: Critical
es: Crítico
pt_pt: Crítico

source: Warning
es: Advertencia
pt_pt: Aviso

source: Checks Performed
es: Verificaciones Realizadas
pt_pt: Verificações Realizadas

# checkIntegrity
source: App Integrity
es: Integridad de la App
pt_pt: Integridade da App

# checkOSVersion
source: Updated System
es: Sistema Actualizado
pt_pt: Sistema Atualizado

# checkScreenLock
source: Screen Lock
es: Bloqueo de Pantalla
pt_pt: Bloqueio de Ecrã

# checkRealDevice
source: Real Device
es: Dispositivo Real
pt_pt: Dispositivo Real

# statusFailed
source: FAILED
es: FALLÓ
pt_pt: FALHOU

source: Understood
es: Entendido
pt_pt: Entendi

# securityLevelSafe
source: Safe
es: Seguro
pt_pt: Seguro

# securityLevelWarning
source: Warnings Detected
es: Advertencias Detectadas
pt_pt: Avisos Detectados

# securityLevelCritical
source: CRITICAL THREATS
es: AMENAZAS CRÍTICAS
pt_pt: AMEAÇAS CRÍTICAS

# securityDescSafe
source: All security checks passed
es: Todas las verificaciones de seguridad pasaron
pt_pt: Todas as verificações de segurança passaram

# securityDescWarning
source: Some settings can be improved
es: Algunas configuraciones pueden mejorar
pt_pt: Algumas configurações podem ser melhoradas

# securityDescCritical
source: Critical threats detected - Action required
es: Amenazas críticas detectadas - Acción necesaria
pt_pt: Ameaças críticas detectadas - Ação necessária

# actionRootTitle
source: Root Device Detected
es: Dispositivo con Root Detectado
pt_pt: Dispositivo com Root Detectado
